In [1]:
import sys
import os
sys.path.append(os.path.abspath(".."))  

from src.data_loading_1 import data_loading
import pandas as pd

In [2]:
df = data_loading()
df.head()

Data loaded successfully.....

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,EstimatedSalary,Balance,NumOfProducts,HasCrCard,IsActiveMember,Exited
0,15634602,Hargrave,619,FRA,Female,42.0,2,€101348.88,€0.0,1,Yes,Yes,1
1,15634602,Hargrave,619,FRA,Female,42.0,2,€101348.88,€0.0,1,Yes,Yes,1
2,15647311,Hill,608,Spain,Female,41.0,1,€112542.58,€83807.86,1,Yes,Yes,0
3,15619304,Onio,502,French,Female,42.0,8,€113931.57,€159660.8,3,No,No,1
4,15701354,Boni,699,FRA,Female,39.0,1,€93826.63,€0.0,2,No,No,0

In [3]:
df = df.drop(columns=['CustomerId','Surname'])
df.head()

,CreditScore,Geography,Gender,Age,Tenure,EstimatedSalary,Balance,NumOfProducts,HasCrCard,IsActiveMember,Exited
0,619,FRA,Female,42.0,2,€101348.88,€0.0,1,Yes,Yes,1
1,619,FRA,Female,42.0,2,€101348.88,€0.0,1,Yes,Yes,1
2,608,Spain,Female,41.0,1,€112542.58,€83807.86,1,Yes,Yes,0
3,502,French,Female,42.0,8,€113931.57,€159660.8,3,No,No,1
4,699,FRA,Female,39.0,1,€93826.63,€0.0,2,No,No,0

In [4]:
df['EstimatedSalary'] = df['EstimatedSalary'].astype(str).str.replace('€', '', regex=False)
df['Balance'] = df['Balance'].astype(str).str.replace('€', '', regex=False)

In [5]:
df['EstimatedSalary'] = df['EstimatedSalary'].astype(float)
df['Balance'] = df['Balance'].astype(float)

In [6]:
df['EstimatedSalary'].value_counts()

EstimatedSalary
 38190.78     4
-999999.00    3
 101348.88    2
 24924.92     2
 121505.61    1
             ..
 102195.16    1
 60843.09     1
 25548.47     1
 134462.29    1
 72927.68     1
Name: count, Length: 9997, dtype: int64

In [7]:
df['Geography'].value_counts()

Geography
Germany    2509
Spain      2477
France     1741
French     1658
FRA        1619
Name: count, dtype: int64

In [8]:
if 'French' or 'FRA' in df['Geography']:
    df['Geography'] = df['Geography'].apply(lambda x:'France' if x=='French' else x)
    df['Geography'] = df['Geography'].apply(lambda x:'France' if x=='FRA' else x)

In [9]:
df['Geography'].value_counts()

Geography
France     5018
Germany    2509
Spain      2477
Name: count, dtype: int64

In [10]:
df['EstimatedSalary'].value_counts()

EstimatedSalary
 38190.78     4
-999999.00    3
 101348.88    2
 24924.92     2
 121505.61    1
             ..
 102195.16    1
 60843.09     1
 25548.47     1
 134462.29    1
 72927.68     1
Name: count, Length: 9997, dtype: int64

In [12]:
if -999999.00 in df['EstimatedSalary']:
    print("yes")

In [54]:
df['EstimatedSalary'] = df['EstimatedSalary'].apply(lambda x:None if x== -999999.00 else x)

In [9]:
def data_cleaning(df):
    try:
        df = df.drop(columns=['CustomerId','Surname'],axis=1)
    except:
        print('Columns already dropped')

    df['EstimatedSalary'] = df['EstimatedSalary'].astype(str).str.replace('€', '', regex=False)
    df['Balance'] = df['Balance'].astype(str).str.replace('€', '', regex=False)
    df['EstimatedSalary'] = df['EstimatedSalary'].astype(float)
    df['Balance'] = df['Balance'].astype(float)
    df['EstimatedSalary'] = df['EstimatedSalary'].apply(lambda x:None if x== -999999.00 else x)

    if 'French' or 'FRA' in df['Geography']:
        df['Geography'] = df['Geography'].apply(lambda x:'France' if x=='French' else x)
        df['Geography'] = df['Geography'].apply(lambda x:'France' if x=='FRA' else x)
    print('Data is cleaned...')
    
    return df

In [10]:
df = data_cleaning(df)

Columns already dropped
Data is cleaned...

In [11]:
df.head()

,CreditScore,Geography,Gender,Age,Tenure,EstimatedSalary,Balance,NumOfProducts,HasCrCard,IsActiveMember,Exited
0,619,France,Female,42.0,2,101348.88,0.00,1,Yes,Yes,1
1,619,France,Female,42.0,2,101348.88,0.00,1,Yes,Yes,1
2,608,Spain,Female,41.0,1,112542.58,83807.86,1,Yes,Yes,0
3,502,France,Female,42.0,8,113931.57,159660.80,3,No,No,1
4,699,France,Female,39.0,1,93826.63,0.00,2,No,No,0

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10004 entries, 0 to 10003
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CreditScore      10004 non-null  int64
 1   Geography        10004 non-null  object
 2   Gender           10004 non-null  object
 3   Age              10001 non-null  float64
 4   Tenure           10004 non-null  int64
 5   EstimatedSalary  10004 non-null  float64
 6   Balance          10004 non-null  float64
 7   NumOfProducts    10004 non-null  int64
 8   HasCrCard        10004 non-null  object
 9   IsActiveMember   10004 non-null  object
 10  Exited           10004 non-null  int64
dtypes: float64(3), int64(4), object(4)
memory usage: 859.8+ KB